export const teachersConfig = [
  {
    title: '卓成 长聘教授，博导',
    email: 'czhuo@zju.edu.cn',
    research: ['设计-制造协同', '低功耗电路与系统', 'AI算法及硬件加速', '电源及信号完整性'],
    avatar: require('../assets/chengzhuo.jpg'),
    link: 'https://person.zju.edu.cn/chengzhuo'
  },
  {
    title: '孙奇 百人计划研究员，博导',
    email: 'qisunchn@zju.edu.cn',
    research: ['AI for EDA', '深度学习硬件推理加速', '设计空间探索'],
    avatar: require('../assets/sunqi.jpg'),
    link: 'https://person.zju.edu.cn/0023146'
  }
]

export const classContent = '集成电路的设计与制造核心竞争力是衡量国家信息科技发展水平核心指标。人工智能（AI）作为一种强大的数据处理与分析工具，在集成电路制造领域的应用潜力巨大。本课程旨在探讨人工智能如何辅助集成电路的设计、制造过程，以及如何提高制造效率和产品质量，围绕人工智能技术在集成电路制造中的应用进行深入讲解。该课程可以引导学生关注集成电路行业发展，关注“大国重器”，培养爱国情怀，扩充科技视野，增强集体荣誉感，成为服务国家和地方的工程应用型人才。 通过理论学习与案例分析，课程将帮助硕士、博士研究生等高级学术人才掌握利用人工智能优化集成电路制造流程的方法论。本课程将采用问题驱动的教学方法，结合实际案例分析和实验操作，强调理论与实践的结合。学生将通过本课程学会如何运用人工智能工具和技术来解决集成电路制造中的实际问题，从而提升他们在这一前沿领域的专业知识水平和技术应用能力，为未来电子工程领域的科研或产业工作打下坚实的基础。'

export const classLink = 'https://heyzine.com/flip-book/61b3c366bd.html';

export const classList = [
  '第一次 1.课程介绍、学习方法、要求与考核标准；2.人工智能基础；3.集成电路制造技术基础。',
  '第二次 机器学习基础(一)数据结构：1.数组与矩阵；2.树与图；3.编程基础。',
  '第三次 机器学习基础(二)：1.无监督学习；2.监督学习；3.变成基础。',
  '第四次 深度学习基础：1.前向传播与反向传播；2.正则化；3.模型优化方法。',
  '第五次 深度学习实践：1.PyTorch基础学习；2.模型实现基础；3.模型训练与推理。',
  '第六次 深度学习模型：1.卷积网络；2.图卷积网络；3.生成模型；4.循环网络与Transformer。',
  '第七次 AI辅助集成电路设计制造-概览： 1.课程项目介绍。',
  '第八次 系统设计与优化(一)：1.综合；2.仿真与回归；3.机器学习与深度学习方法讨论。',
  '第九次 系统设计与优化(二)：1。设计空间探索；2.机器学习与深度学习方法讨论。',
  '第十次 课程项目讨论',
  '第十一次 热点检测(一)：机器学习与人工智能方法应用综述。',
  '第十二次 热点检测(二)：聚类、注意力学习等方法详述。',
  '第十三次 课程项目讨论',
  '第十四次 光学邻近校正(一)：机器学习与人工智能方法应用综述。',
  '第十五次 光学邻近校正(二)：生成对抗网络与强化学习等方法详述',
  '第十六次 课程项目展示'
]

export const classIndexList = [
  '第一周','第二周','第三周','第四周','第五周','第六周','第七周','第八周',
  '第九周','第十周','第十一周','第十二周','第十三周','第十四周','第十五周','第十六周'
]